Cases/Base/0_orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform $flowVelocity;
    }
    OUTLET
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform $flowVelocity; 
    }
    WALL
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    CUBE1
    {
        type            noSlip;
    }
    CUBE2
    {
        type            noSlip;
    }
    RIGHT
    {
        type            cyclic;
    }
    LEFT
    {
        type            cyclic;
    }
    TOP
    {
        type            slip;
    }
}


// ************************************************************************* //
