Cases/Base/0_orig/include/topLeftRightPatches
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

TOP
{
    type zeroGradient;
}

LEFT
{
    type cyclic;
}

RIGHT
{
    type cyclic;
}

// ************************************************************************* //
