Cases/Base/0_orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    #include "include/fixedInlet"

    OUTLET
    {
        type            inletOutlet; 
        inletValue      $internalField;
        value           $internalField;
    }
    
    WALL
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    CUBE1
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    CUBE2
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    #include "include/topLeftRightPatches"
}


// ************************************************************************* //
