Cases/Base/0_orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    WALL
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    CUBE1
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    CUBE2
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    "(TOP|INLET|OUTLET)"
    {
        type            calculated;
        value           uniform 0;
    }

    "(LEFT|RIGHT)"
    {
        type            cyclic;
    }
}


// ************************************************************************* //
