Cases/Base/system/fileUpdate
/*--------------*- C++ -*----------- File generated by PyFoam ---------------*\ 
| =========                 |                                                 | 
| \      /  F ield          | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration      | Version:  v()                          | 
|   \  /    A nd            | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation   |                              (##############,   | 
|---------------------------                        /######################*  | 
|                                              ############################   | 
|                                         (###############################    | 
|                                     *########     #####################     | 
|                                  ##.                   ##############       | 
|        McLaren Racing Ltd                               ,##########         | 
|    McLaren Technology Centre,                            #######            | 
|    Chertsey Road, Woking, UK                            (#####              | 
|            GU21 4YH                                    .###                 | 
|                                                       ##                    | 
\*---------------------------------------------------------------------------*/ 
FoamFile
{
    version 2;
    format ascii;
    class dictionary;
    object "fileUpdate";
}

fvSchemesUpdate
{
  fileToUpdate "<system>/fvSchemes";
  libs
    (
      "libutilityFunctionObjects.so"
    );
  timeVsFile
    (

      (
        -1
        "<system>/fvSchemes_0"
      )

      (
        0.1
        "<system>/fvSchemes_1"
      )

      (
        0.2
        "<system>/fvSchemes_2"
      )

      (
        0.5
        "<system>/fvSchemes_3"
      )
    );
  type timeActivatedFileUpdate;
  writeControl timeStep;
  writeInterval 1;
}

fvSolutionUpdate
{
  fileToUpdate "<system>/fvSolution";
  libs
    (
      "libutilityFunctionObjects.so"
    );
  timeVsFile
    (

      (
        -1
        "<system>/fvSolution_0"
      )

      (
        0.1
        "<system>/fvSolution_1"
      )

      (
        0.2
        "<system>/fvSolution_2"
      )

      (
        0.5
        "<system>/fvSolution_3"
      )
    );
  type timeActivatedFileUpdate;
  writeControl timeStep;
  writeInterval 1;
}

