Cases/Base/system/lines
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      lines;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

lines
{
    type            	sets;
    libs            	("libsampling.so");
    writeControl    	writeTime;

    setFormat   	raw;
    fields          	(p U k);

    interpolationScheme cellPoint;

    sets
    (
        x0.0
	    {
		    type	midPointAndFace;
		    axis  	y;
		    start	(0.001 0 0);
		    end	(0 2 0);
	    }

        x0.5
        {
                type    midPointAndFace;
                axis    y;
                start   (0.5 0 0);
                end     (0.5 2 0);
        }

        x1.0
        {
                type    midPointAndFace;
                axis    y;
                start   (1 0 0);
                end     (1 2 0);
        }
        
        x1.5
        {
                type    midPointAndFace;
                axis    y;
                start   (1.5 0 0);
                end     (1.5 2 0);
        }

        x2.0
        {
                type    midPointAndFace;
                axis    y;
                start   (2 1 0);
                end     (2 2 0);
        }

        x2.5
        {
                type    midPointAndFace;
                axis    y;
                start   (2 1 0);
                end     (2 2 0);
        }

        x3.0
        {
                type    midPointAndFace;
                axis    y;
                start   (3 1 0);
                end     (3 2 0);
        }

        x3.5
        {
                type    midPointAndFace;
                axis    y;
                start   (3.5 0 0);
                end     (3.5 2 0);
        }

        x4.0
        {
                type    midPointAndFace;
                axis    y;
                start   (4 0 0);
                end     (4 2 0);
        }

        x4.5
        {
                type    midPointAndFace;
                axis    y;
                start   (4.5 0 0);
                end     (4.5 2 0);
        }

        x5.0
        {
                type    midPointAndFace;
                axis    y;
                start   (5 0 0);
                end     (5 2 0);
        }

        x5.5
        {
                type    midPointAndFace;
                axis    y;
                start   (5.5 0 0);
                end     (5.5 2 0);
        }

        x5.0
        {
                type    midPointAndFace;
                axis    y;
                start   (5 0 0);
                end     (5 2 0);
        }

        x5.5
        {
                type    midPointAndFace;
                axis    y;
                start   (5.5 0 0);
                end     (5.5 2 0);
        }

        x6.0
        {
                type    midPointAndFace;
                axis    y;
                start   (6 0 0);
                end     (6 2 0);
        }

        x6.5
        {
                type    midPointAndFace;
                axis    y;
                start   (6.5 0 0);
                end     (6.5 2 0);
        }

        x7.0
        {
                type    midPointAndFace;
                axis    y;
                start   (7 1 0);
                end     (7 2 0);
        }

        x7.5
        {
                type    midPointAndFace;
                axis    y;
                start   (7.5 1 0);
                end     (7.5 2 0);
        }

        x8.0
        {
                type    midPointAndFace;
                axis    y;
                start   (8 1 0);
                end     (8 2 0);
        }

        x8.5
        {
                type    midPointAndFace;
                axis    y;
                start   (8.5 0 0);
                end     (8.5 2 0);
        }

        x9.0
        {
                type    midPointAndFace;
                axis    y;
                start   (9 0 0);
                end     (9 2 0);
        }

        x9.5
        {
                type    midPointAndFace;
                axis    y;
                start   (9.5 0 0);
                end     (9.5 2 0);
        }

        x10.0
        {
                type    midPointAndFace;
                axis    y;
                start   (10 0 0);
                end     (10 2 0);
        }

        x10.5
        {
                type    midPointAndFace;
                axis    y;
                start   (10.5 0 0);
                end     (10.5 2 0);
        }

        x11.0
        {
                type    midPointAndFace;
                axis    y;
                start   (11 0 0);
                end     (11 2 0);
        }

        x11.5
        {
                type    midPointAndFace;
                axis    y;
                start   (11.5 0 0);
                end     (11.5 2 0);
        }

        x12.0
        {
                type    midPointAndFace;
                axis    y;
                start   (12 0 0);
                end     (12 2 0);
        }

        x12.5
        {
                type    midPointAndFace;
                axis    y;
                start   (12.5 0 0);
                end     (12.5 2 0);
        }

        x13.0
        {
                type    midPointAndFace;
                axis    y;
                start   (13 0 0);
                end     (13 2 0);
        }

        x13.5
        {
                type    midPointAndFace;
                axis    y;
                start   (13.5 0 0);
                end     (13.5 2 0);
        }

        x14.0
        {
                type    midPointAndFace;
                axis    y;
                start   (14 0 0);
                end     (14 2 0);
        }


    );
}


// ************************************************************************* //
