Cases/Base/system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

surfaces
{
    type            	surfaces;
    libs            	("libsampling.so");
    writeControl    	writeTime;

    surfaceFormat   vtk;
    fields          (p U k);

    interpolationScheme cellPoint;

    surfaces
    (
        zNormal
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            pointAndNormalDict
            {
                point   (0 0 0);
                normal  (0 0 1);
            }
            interpolate     true;
        }

        yNormal
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            pointAndNormalDict
            {
                point   (0 0.1 0);
                normal  (0 1 0);
            }
            interpolate     true;
        }

        yHalf
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            pointAndNormalDict
            {
                point   (0 0.5 0);
                normal  (0 1 0);
            }
            interpolate     true;
        }

        inlet
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            pointAndNormalDict
            {
                point   (0 4 0);
                normal  (0 1 0);
            }
            interpolate     true;
        }


    );
}


// ************************************************************************* //
